import Foundation
import OrderedCollections

struct MockTagsData {
    static var tags : OrderedSet = ["Абстракция", "Автомобили", "Аромат", "Архитектура", "Баланс", "Вода", "Газон", "Город", "Графика", "Дизайн", "Еда", "Жемчужина", "Живопись", "Животные", "Закат", "Звезды", "Иллюминация", "Интерьер", "Искусство", "Карнавал", "Кофе", "Кристалл", "Культура", "Лавина", "Ландшафт", "Люди", "Макро", "Маскарад", "Минимализм", "Мода", "Музыка", "Облака", "Пейзаж", "Плетение", "Пляж", "Природа", "Путешествия", "Рефлексия", "Романтика", "Сказочное", "Созвездие", "Солнце", "Спорт", "Технологии", "Традиция", "Фантазия", "Фэнтези", "Цветы", "Экзотика", "Эксперимент"]
    
    static func getMockData() -> [String] {
        return tags.elements
    }
    
    static func addNewTag(_ tag: String) {
        tags.append(tag)
        tags.sort()
        
        // change DB after appending new tag
    }
}
